Repository: Py-AMS/pyams-auth-jwt
Catalog: src/pyams_auth_jwt/locales/*/LC_MESSAGES/pyams_auth_jwt.po
Languages: fr

source: JWT client key: {}
fr: Clé JWT : {}

source: JWT authentication
fr: Authentification JWT

source: Key ID
fr: ID de la clé

source: This ID must be unique between all JWT client keys, and provided as 'kid' tokens header
fr: Cet ID doit être unique parmi toutes les clés JWT, et fournie dans l'en-tête 'kid' des jetons JWT

source: Enabled client key?
fr: Clé JWT active ?

source: Select 'no' to disable this client key temporarily
fr: Sélectionner 'non' pour désactiver cette clé JWT temporairement

source: Client key label
fr: Libellé de la clé

source: This label will be used to identify the client key
fr: Le libellé n'est utilisé que pour identifier la clé dans l'interface d'administration

source: Issuer
fr: Émetteur

source: JWT tokens matching this client_key will be accepted only if their issuer ('iss' claim) is matching this value
fr: Les jetons JWT correspondant à cette clé ne seront acceptés que si leur émetteur (champ 'iss' des revendications du ticket) correspond à cette valeur

source: JWT tokens matching this client key will be accepted only if their audience ('aud' claim) is matching this value
fr: Les jetons JWT correspondant à cette clé ne seront acceptés que si leur audience ('champ 'aud' des revendications du ticket) correspond à cette valeur

source: Client public key
fr: Clé publique

source: The public key is required when using RS* algorithm
fr: Une clé publique est nécessaire pour utiliser un encryptage de type RS*

source: JWT encoding algorithm
fr: Algorithme d'encryptage

source: Protocol used by the client key
fr: Protocole utilisé pour le cryptage des jetons JWT

source: Associated principal
fr: Mandataire associé

source: If defined, this will identify the principal which will be used when a request will be authenticated with this JWT client key
fr: S'il est défini, ce mandataire sera utilisé en lieu et place de la clé pour authentifier les requêtes qui l'utiliseront

source: Selected principal can't be another JWT client key!
fr: Le mandataire sélectionné ne peut pas être une autre clé JWT !

source: Activation date
fr: Date d'activation

source: This JWT client key will be enabled only after this date
fr: La clé JWT ne sera active qu'à partir de cette date

source: Expiration date
fr: Date d'expiration

source: This JWT client key will not be enabled after this date
fr: La clé JWT ne sera pas active au-delà de cette date

source: Restrict referrers
fr: Restreindre les référents

source: If this option is enabled, only selected referrers will be enabled
fr: Si cette option est activée, seuls les référents indiqués ci-dessous seront autorisés

source: Allowed referrers
fr: Référents autorisés

source: Only selected referrers will be allowed to use this client key
fr: Seules les requêtes dont l'origine correspond à l'un de ces référents seront authentifiées

source: Audience defines the target of JWT tokens
fr: L'audience définit le destinataire des jetons JWT générés par le module

source: Access token attribute
fr: Nom du jeton d'accès

source: Name of the JSON attribute containing access token returned by REST APIs
fr: Nom de l'attribut JSON retourné par l'API REST contenant le jeton d'accès

source: Refresh token attribute
fr: Nom du jeton de rafraîchissement

source: Name of the JSON attribute containing refresh token returned by REST APIs
fr: Nom de l'attribut JSON retourné par l'API REST contenant le jeton de rafraîchissement

source: Enable JWT direct authentication?
fr: Activer le mode "local" ?

source: Enable direct login via JWT authentication
fr: Activer la gestion en local des jetons JWT

source: HS* protocols are using a shared secret, RS* protocols are using RSA keys and ES* protocols are using ECDSA keys; ES* protocols are as safe as RS* protocols but quicker than RS* protocols for the same hash length
fr: Les protocoles HS* utilisent un secret partagé, les protocoles RS* utilisent des clés RSA et les protocoles ES* utilisent des clés ECDSA ; les protocoles ES* sont aussi sécurisés que les protocoles RS*, mais plus rapides pour des longueurs de clés de hashages équivalentes

source: JWT secret
fr: Code secret

source: This secret is required when using HS* encryption
fr: Ce code secret est nécessaire si vous utilisez un encryptage de type HS*

source: JWT private key
fr: Clé privée

source: The secret key is required when using RS* algorithm
fr: Une clé privée est nécessaire pour utiliser un encryptage de type RS*

source: JWT public key
fr: Clé publique

source: Access token lifetime
fr: Durée de vie des jetons d'accès

source: JWT access token lifetime, in seconds
fr: Durée de vie des jetons d'accès JWT, en secondes

source: Refresh token lifetime
fr: Durée de vie des jetons de refresh

source: JWT refresh token lifetime, in seconds
fr: Durée de vie des jetons de rafraîchissement, en secondes

source: Enable JWT proxy authentication?
fr: Activer le mode "proxy" ?

source: If this option is enabled, tokens management requests will be forwarded to another authentication authority
fr: Si cette option est activée, la gestion des jetons JWT est déléguée à une autre autorité d'authentification

source: Authentication authority
fr: Autorité d'authentification

source: Base URL (protocol and hostname) of the authentication authority to which tokens management requests will be forwarded
fr: URL de base (protocole et nom d'hôte) de l'autorité d'authentification à laquelle est déléguée la gestion des jetons

source: Token getter service
fr: Service d'obtention

source: REST HTTP service used to get a new token
fr: URL relative du service REST permettant de récupérer de nouveaux jetons JWT à partir d'un login et d'un mot de passe

source: Name of the JSON attribute returned by REST API containing access tokens
fr: Nom de l'attribut JSON retourné par l'API REST contenant les jetons d'accès

source: Name of the JSON attribute returned by REST API containing refresh tokens
fr: Nom de l'attribut JSON retourné par l'API REST contenant les jetons de rafraîchissement

source: Token claims getter
fr: Service de consultation

source: REST HTTP service used to extract claims from provided authorization token
fr: URL relative du service REST permettant d'extraire les "réclamations" (claims) des jetons JWT

source: Token refresh service
fr: Service de rafraîchissement

source: REST HTTP service used to get a new access token with a refresh token
fr: URL relative du service REST permettant de récupérer un nouveau jeton d'accès à partir d'un jeton de rafraîchissement

source: Token verify service
fr: Service de vérification

source: REST HTTP service used to check validity of an existing token
fr: URL relative du service REST permettant de vérifier la validité d'un jeton

source: Verify SSL?
fr: Vérification SSL ?

source: If 'no', SSL certificates will not be verified
fr: Si 'non', les certificats SSL ne seront pas vérifiés

source: Use verified tokens cache?
fr: Mettre les jetons en cache ?

source: If selected, this option allows to store credentials in a local cache from which they can be reused
fr: En sélectionnant cette option, les jetons validés seront mis en cache, de façon à limiter les requêtes auprès de l'autorité d'authentification

source: Selected tokens cache
fr: Cache de jetons

source: Beaker cache selected to store validated tokens
fr: Cache pré-défini dans lequel seront stockés les jetons

source: You can't enable both local and proxy modes
fr: Vous ne pouvez pas activer le mode local et le mode proxy en même temps !

source: You must choose an algorithm to enable JWT authentication
fr: Vous devez sélectionner un algorithme d'encryptage pour activer l'authentification JWT

source: You must define JWT secret to use HS* algorithms
fr: Vous devez définir un code secret pour utiliser un algorithme de type HS*

source: You must define a private and a public key to use RS* or ES* algorithms
fr: Vous devez définir une clé privée et une clé publique pour utiliser un algorithme de type RS* ou ES*

source: You must define authentication authority to use proxy mode
fr: Vous devez indiquer l'autorité d'authentification pour utiliser le mode proxy !

source: You must choose a cache to enable tokens caching
fr: Vous devez sélectionner un cache pour activer la mise en cache des jetons

source: JWT configuration
fr: Configuration JWT

source: JWT tokens settings
fr: Paramétrage des jetons JWT

source: JWT authentication module "local mode" allows to generate, check and refresh tokens locally. You can choose to use a simple secret key to encrypt your tokens, or to use a private and public keys pair (which can to be used to share tokens between two applications).
fr: Le mode "local" du module d'authentification JWT permet de générer, vérifier et rafraîchir les jetons JWT localement. Vous pouvez utiliser un simple secret pour encrypter les jetons, ou utiliser un couple de clés publique et privée (qui peuvent notamment être utilisées pour partager des jetons entre plusieurs applications qui peuvent s'appuyer sur une autorité d'authentification commune).

source: To generate your RSA keys for RS* protocols, use: openssl genpkey -algorithm RSA -out private-key-rsa.pem openssl rsa -pubout -in private-key-rsa.pem -out public-key-rsa.pem To generate ECDSA keys for ES* protocols, use: openssl ecparam -genkey -name secp521r1 -out private-key-ecdsa.pem openssl ec -pubout -in private-key-ecdsa.pem -out public-key-ecdsa.pem
fr: Pour générer des clés RSA keys destinées aux protocoles RS*, utilisez: openssl genpkey -algorithm RSA -out private-key-rsa.pem openssl rsa -pubout -in private-key-rsa.pem -out public-key-rsa.pem Pour générer des clés ECDSA destinées aux protocoles ES*, utilisez: openssl ecparam -genkey -name secp521r1 -out private-key-ecdsa.pem openssl ec -pubout -in private-key-ecdsa.pem -out public-key-ecdsa.pem

source: JWT authentication module "proxy mode" relies on another authentication authority (which can be another application using this JWT package) to generate, check and refresh tokens. This authority can be used to share access tokens between different applications. You can cache tokens to reduce the number of requests which will be forwarded to the authentication authority.
fr: Le mode "proxy" du module d'authentification JWT s'appuie sur une autre autorité d'authentification (qui peut être une autre application utilisant le même package JWT en mode local) pour générer, vérifier et rafraîchir les jetons JWT, via la même API REST. Cette autorité peut par ailleurs être utilisée par différentes applications pour partager des jetons. Vous pouvez également choisir d'activer un cache dans lequel seront stockés les jetons validés, afin de limiter le nombre de requêtes transmises à l'autorité d'authentification.

source: JWT client keys
fr: Clés JWT

source: Click icon to enable or disable this client key
fr: Cliquer pour activer ou désactiver cette clé

source: Label
fr: Libellé

source: Principal
fr: Mandataire

source: Add JWT client key
fr: Ajouter une clé JWT

source: New JWT client key
fr: Nouvelle clé JWT

source: New JWT client key properties
fr: Propriétés de la nouvelle clé JWT

source: Plug-in: JWT client keys authentication
fr: Module : Authentification JWT

source: This client ID is already used!
fr: Cet identifiant de clé est déjà utilisé !

source: JWT client key properties
fr: Propriétés de la clé
